app/views/channels/_form.html.erb

SELECT "languages".* FROM "languages" WHERE "languages"."shortname" = 'en' LIMIT 1
---
        <%= f.label :language %> <br />
        <%= f.select :language, Language.all.collect {|p| [ p.name, p.shortname ] }, :include_blank => @cur_language_name %>