app/views/channels/index.mobile.erb

SELECT "languages".* FROM "languages"
SELECT "videos".* FROM "videos" INNER JOIN "channels_videos" ON "videos"."id" = "channels_videos"."video_id" WHERE "channels_videos"."channel_id" = 1
---
	 <p class="post-channeltitle"><a href="/channels/<%= chan.id %>/videos"><span><%= chan.name %></span></a></p>
         <p class="post-channelid"> <i>#<%= chan.id %></i> <em><%= chan.language %></em> <i><%= Time.parse(chan.created_at.to_s).strftime("Created on %m/%d/%Y") %></i> <em><%= chan.videos.size %> videos</em></p>