app/views/channels/index.html.erb

SELECT "languages".* FROM "languages"
---
<% if false %>
<!--<%= f.select :language,   Language.all.collect {|p| [ p.name, p.shortname ] } %>-->