app/views/channels/new.mobile.erb

<% if false %>
     <!--<input type="button" value="Do you need more channels?" onClick="canCreateMyChannels(<%=    @user.channels.count %>)" />-->
---
SELECT COUNT(*) FROM "channels" WHERE "channels"."user_id" = 3