app/views/channels/show.html.erb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."channel_id" = 1
---
<h2>Feeds</h2>
<% @channel.feeds.each do |feed| %>