app/views/users/channels.mobile.erb

	 <p class="post-channeltitle"><span><%= chan.name %></span></p>
         <p class="post-channelid"> <i>#<%= chan.id %></i> <em><%= chan.language %></em> <i><%= Time.parse(chan.created_at.to_s).strftime("Created on %m/%d/%Y") %></i> <em><%= chan.videos.size %> videos</em></p>
---
SELECT "videos".* FROM "videos" INNER JOIN "channels_videos" ON "videos"."id" = "channels_videos"."video_id" WHERE "channels_videos"."channel_id" = 2