app/views/users/channels.html.erb

SELECT "videos".* FROM "videos" INNER JOIN "channels_videos" ON "videos"."id" = "channels_videos"."video_id" WHERE "channels_videos"."channel_id" = 4
---
	 <div class="post-channeltitle"><%= link_to h(chan.name), videos_channel_path(chan) %></div>
         <div class="post-channelid"> <i>#<%= chan.id %></i> <em><%= chan.language %></em> <i><%= Time.parse(chan.created_at.to_s).strftime("Created on %m/%d/%Y") %></i> <%= chan.videos.size %> videos</div>