app/controllers/authentications_controller.rb

  def create
     omniauth = request.env["omniauth.auth"]
debugger
     authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
     if authentication
        flash[:notice] = "Signed in successfully with auth."
debugger
        ### to authentication's user
        sign_in_and_redirect(:user, authentication.user)
     elsif current_user
        ### to current user
        current_user.authentications.create(:provider => omniauth['provider'], :uid => omniauth['uid'])
        flash[:notice] = "Authentication successful with current user."
debugger
        redirect_to authentications_url
     else
        user = User.new
        ###user.authentications.build(:provider => omniauth ['provider'], :uid => omniauth['uid'])
debugger
        user.apply_omniauth(omniauth)
debugger
	if user.save
	  flash[:notice] = "Signed up and Signed in successfully."
	  sign_in_and_redirect(:user, user)
	else
          ### dont need extra key
	  session[:omniauth] = omniauth.except('extra')
debugger
          if user.email
             new_user = User.find_by_email(user.email)
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '1722351527' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 22 Oct 2012 19:32:12 UTC +00:00], ["provider", "facebook"], ["uid", "1722351527"], ["updated_at", Mon, 22 Oct 2012 19:32:12 UTC +00:00], ["user_id", 11]]
INSERT INTO "users" ("admin", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "language", "last_sign_in_at", "last_sign_in_ip", "password_salt", "payment", "remember_created_at", "remember_me", "remember_token", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
SELECT 1 FROM "users" WHERE "users"."email" = 'hongkyukim@yahoo.com' LIMIT 1