app/controllers/channels_controller.rb

  def index
    ## provide all channels
    ##@user = User.find(params[:user_id])
    ##@channels = @user.channels
    ### get all channels

    ###@channels = Channel.all

    ###channels = Channel.find(:all)
    ### update thumbnail_url for channels
    ###channels.each { |c|   c.update_attributes({ "thumbnail_url" => c.videos[0].thumbnail_url}) if c.thumbnail_url.blank? }

    ###channels = Channel.find(:all)
    ### update thumbnail_url for channels
    ###channels.each { |c|    raise false if c.thumbnail_url.blank? }


    ###@channels = Channel.search(params[:search]).reverse
    ###@products = Product.order(sort_column + ' ' + sort_direction).paginate(:per_page => 5, :page => params[:page])
    ##@channels = Channel.search(params[:search]).reverse
    ###@channels = Channel.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 3, :page => params[:page]).reverse

    userlanguages = cookies[:user_languages] if cookies[:user_languages]
###debugger
    search_channels = Channel.search(params[:search], userlanguages)

    search_channels_all = Channel.search(params[:search])
##debugger
    if search_channels == 1 || search_channels.nil? || search_channels.count == 0
---
SELECT "channels".* FROM "channels" WHERE (language LIKE '%ko%') AND (channel_type LIKE '%selected%')
SELECT COUNT(*) FROM "channels" WHERE (language LIKE '%en%' or language LIKE '%%') AND (channel_type LIKE '%selected%')

  def show
    ###@user = User.find(params[:user_id])
    ##@user = User.find(params[:user_id])
    @channel = Channel.find(params[:id])
    @user = User.find(@channel.user_id)
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def new
    ##@channel = Channel.new
    ##@user = User.find(params[:user_id])
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    ##@channel = Channel.find(params[:id])
    ##@user = User.find(params[:user_id])
    @channel = Channel.find(params[:id])
    @user = User.find(@channel.user_id)
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    ###@channel = Channel.new(params[:channel])
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1



    respond_to do |format|
      if @channel.save
---
INSERT INTO "channels" ("categories", "channel_type", "created_at", "language", "name", "querytime", "tags", "thumbnail_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "channels" SET "querytime" = '2012-10-19 04:35:43.000000', "thumbnail_url" = 'http://i.ytimg.com/vi/tU9pkFsdYpg/default.jpg', "updated_at" = '2012-10-19 04:35:43.730944' WHERE "channels"."id" = 3

  def update
    ##@channel = Channel.find(params[:id])
    @user = User.find(params[:user_id])
    @channel = @user.channels.find(params[:id])

    respond_to do |format|
      if @channel.update_attributes(params[:channel])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "channels".* FROM "channels" WHERE "channels"."user_id" = 3 AND "channels"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "channels" SET "channel_type" = 'selected2', "tags" = '', "categories" = '', "updated_at" = '2012-10-19 01:58:23.995724' WHERE "channels"."id" = 1

  def destroy
    ##@channel = Channel.find(params[:id])
    ##@channel.destroy
    ##@user = User.find(params[:user_id])
    ##@channel = Channel.find(params[:id])

    @channel = Channel.find(params[:id])
    @user = User.find(@channel.user_id)

    @channel.destroy
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT 1  [["id", "21"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
DELETE FROM "channels" WHERE "channels"."id" = $1  [["id", 21]]

  def videos
    @channel = Channel.find(params[:id])

    #### search and add new videos if not within 1 hour(3600 seconds)
    newtime = DateTime.now
    oldtime = @channel.querytime.nil? ? DateTime.now - 2.days : @channel.querytime
    diff_time = (newtime.to_i-oldtime.to_i)/3600.00

    if diff_time > 0.999
        #### search and add new videos
        Feed.make_firstfeed(@channel)
        @channel.update_attributes({ "querytime" => DateTime.now})
    end

    @videos = Channel.find(params[:id]).videos.reverse
---
SELECT "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "channels" SET "querytime" = '2012-10-19 01:19:10.000000', "updated_at" = '2012-10-19 01:19:11.030738' WHERE "channels"."id" = 1
SELECT 1 FROM "videos" INNER JOIN "channels_videos" ON "videos"."id" = "channels_videos"."video_id" WHERE "channels_videos"."channel_id" = 1 AND "videos"."id" = 1 LIMIT 1