app/controllers/channels_controller.rb

  def new
    ##@channel = Channel.new
    ##@user = User.find(params[:user_id])
    @user = User.find(params[:user_id])
    @channel = @user.channels.build
    @user_language = get_user_language

    if cookies[:user_languages]
       userlanguage = cookies[:user_languages]
    else
       userlanguage = "en"
    end
    current_language = Language.find_by_shortname(userlanguage);
---
SELECT "languages".* FROM "languages" WHERE "languages"."shortname" = 'en' LIMIT 1

  def edit
    ##@channel = Channel.find(params[:id])
    ##@user = User.find(params[:user_id])
    @channel = Channel.find(params[:id])
    @user = User.find(@channel.user_id)

    if cookies[:user_languages]
       userlanguage = cookies[:user_languages]
    else
       userlanguage = "en"
    end

    current_language = Language.find_by_shortname(userlanguage);
---
SELECT "languages".* FROM "languages" WHERE "languages"."shortname" = 'jp' LIMIT 1

    else
       userlanguage = "en"
    end
    current_language = Language.find_by_shortname(userlanguage);
---
SELECT "languages".* FROM "languages" WHERE "languages"."shortname" = 'jp' LIMIT 1