app/controllers/cookie_controller.rb

SELECT "languages".* FROM "languages" WHERE "languages"."shortname" = 'hi' LIMIT 1
---
  def new
     @languages = Language.find(:all)
     if cookies[:user_languages]
        @user_languages = cookies[:user_languages]
        if cookies[:user_languages] ==""
            @user_languages = "en"
        end
     else
        @user_languages = "en"
     end
     @current_language = Language.find_by_shortname(@user_languages);