app/controllers/pages_controller.rb

  def show
    @page = Page.find_by_permalink!(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."permalink" = 'about' LIMIT 1