app/controllers/users_controller.rb

  def channels
    @user = User.find(params[:id])
    ### consider languages
    if cookies[:user_languages]
       userlanguages = cookies[:user_languages]
    else
       userlanguages = "en"
    end
    emptylanguages = ""
    if userlanguages == "en"
       tmp_channels = @user.channels.where('language LIKE ? or language LIKE ?', "%#{userlanguages}%", "#{emptylanguages}")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "channels".* FROM "channels" WHERE "channels"."user_id" = 3 AND (language LIKE '%en%' or language LIKE '%%')